# Pandas

Pandas is a Python library used for working with data sets. It has functions for analyzing, cleaning, exploring, and manipulating data.

# Pandas - DataFrames Part 1

A DataFrame is a bunch of Series, which shares the same indexes, lets understand this by seeing some examples:

In [81]:
import numpy as np
import pandas as pd

In [82]:
from numpy.random import randn

In [83]:
np.random.seed(101)

In [84]:
df = pd.DataFrame(randn(5,4), ['A','B','C','D','E'], ['W','X','Y','Z'])

In [85]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In the Above Example, W,X,Y,Z are the Pandas Series only, with the common indexes as A,B,C,D,E

So, Basically DataFrames are bunch of Series sharing same indexes
***

<b>Now lets see how we can grab the element from the DataFrame</b>

<b> Selecting Column: </b>

In [86]:
df['W'] # Basically grabbing 'W' Series

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [87]:
type(df['W'])

pandas.core.series.Series

In [88]:
df.W # This is also another way to access the Column but not recommended!!

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

There can be multiple different inbuilt DataFrame functions which are available to us by using Dot operator that is why you should not use the Dot Operator to access the columns!

In [89]:
df[['W','Z']] # Accessing multiple column

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [90]:
type(df)

pandas.core.frame.DataFrame

In [91]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [92]:
df['New_Column'] = df['W']

In [93]:
df

          W         X         Y         Z  New_Column
A  2.706850  0.628133  0.907969  0.503826    2.706850
B  0.651118 -0.319318 -0.848077  0.605965    0.651118
C -2.018168  0.740122  0.528813 -0.589001   -2.018168
D  0.188695 -0.758872 -0.933237  0.955057    0.188695
E  0.190794  1.978757  2.605967  0.683509    0.190794

Now, in order to add some more columns in this, I can't Directly add the columns just by specifying df['New_Column'], because it wont recognize this new column,<br>

So we basically, say df['New_Column'] = df['W'] or df['Z'] or df['any other column name'], just to tell that,<br>

We are not accessing the column, we want to add another column in that!!

In [94]:
df.drop('New_Column', axis = 1) # axis = 1 means column here

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

Here we are deleting New_Column by saying 'axis=1', here axis refers to either rows or columns,<br>
if the axis is set to 0 (axis=0), that means its row,<br>
if the axis is set to 1 (axis=1), that means its column!

But, <b>Note:</b> here this delete action won't delete the column from original df!, see now if I print df it would still print New_Column:

In [95]:
df

          W         X         Y         Z  New_Column
A  2.706850  0.628133  0.907969  0.503826    2.706850
B  0.651118 -0.319318 -0.848077  0.605965    0.651118
C -2.018168  0.740122  0.528813 -0.589001   -2.018168
D  0.188695 -0.758872 -0.933237  0.955057    0.188695
E  0.190794  1.978757  2.605967  0.683509    0.190794

The reason behind this, why pandas don't change it originally is, that it wont want you to loose the data, if in future any adjustements as been made!

<b> So if you want to make the change in original place, you have to say 'inplace=True' in parameter also </b>

Example:

In [96]:
df.drop("New_Column", axis=1, inplace=True) #Here inplace=True will be permanent

In [97]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [98]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [102]:
df.drop("E")

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

Here in the above Example, we dont have to mention axis, because the axis is by default set to 0, so in this case 'E' row will be deleted

In [103]:
df # But originally it was the same because we did not use inplace!

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

***
<b>QA<br>
Why here axis is 0 and 1 for rows and columns? </b>

This is because, DataFrames are built on NumPy arrays only, Basically here one DataFrame is just like a Numpy Martix only

For example:

In [104]:
df.shape

(5, 4)

if u print df.shape it prints (5,4), meaning its 5x4 matrix, here 5 is representing <b>"index 0"</b> and 2nd 4 is representing  <b>"index 1"</b>

Thats why, here axis is 0 and 1 in DataFrames
***

<b>Selecting Row</b>

There are 2 ways of doing that! <br>
1) loc Function - just directly pass label name<br>
2) iloc Function - pass number of row starting from zero

In [105]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [106]:
df.loc['A'] # Just pass the Label name

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [107]:
df.iloc[0] # Just pass the index of the row

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

So from above example, this can be said that rows are also Series, as they get printed in a Series kind of format when you try to access the row

In [108]:
 df.iloc[1]

W    0.651118
X   -0.319318
Y   -0.848077
Z    0.605965
Name: B, dtype: float64

<b> Accessing the Subset of the DataFrame using loc and iloc function </b>

In [111]:
df.loc['A','W'] # Passing the Label

2.706849839399938

In [112]:
df.iloc[0,0] # Passing the number of row and column starting from Zero

2.706849839399938

In [114]:
df.loc[['A','B'],['W','X']] # Passing Multiple Row Labels and Columns lables

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318

In [116]:
df.iloc[[0,1],[0,1]]# Passing Multiple Indexes of Rows and Columns

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318

***

# Pandas - DataFrames Part 2

In [8]:
import numpy as np
import pandas as pd

In [9]:
from numpy.random import randn

In [190]:
np.random.seed(101)

In [191]:
df = pd.DataFrame(randn(5,4), ['A','B','C','D','E'], ['W','X','Y','Z'])

In [192]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

# Conditional Selection

In [193]:
df > 0 # Passsing a Condition on df using comparison operator

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [194]:
bool_df = df > 0 # storing that in a Var

In [195]:
bool_df # Printing that variable

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [196]:
df[bool_df] # passing that variable into the df[] to select that condition

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [197]:
df[df > 0] # We can do the same job like this also

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [198]:
df # Printing df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [199]:
df['W'] > 0 #Condition where we want W to print the boolean values

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [200]:
df['W'] # printing W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [201]:
df[df['W'] > 0] # This will only print W row with values > 0

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [202]:
df # Original DataFrame

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [203]:
df[df['Z'] < 0] # Grabbing Columns

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [204]:
resultdf = df[df['W'] > 0] #Storing the conditinal df in a variable

In [205]:
resultdf

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [206]:
resultdf['X'] # then selecting the column

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

I can do the same thing in one step:-

In [207]:
df[df['W']>0]['X'] # I can stack the commands like this

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [208]:
df[df['W']>0][['Y','X']] # grabbing more columns

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

We can do it like this also:

In [209]:
boolseries = df['W'] > 0
result = df[boolseries]
mycols = ['Y','X']
result[mycols]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

We will be using more of &nbsp; "df[df['W']>0][['Y','X']]" &nbsp;  kind of one line code in the future, don't worry at first it will be a little difficult but soon, you will get it, as you use pandas more and more

<b> Will select more data by passing more and more conditions now</b>

In [210]:
df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [211]:
df[(df['W']>0) | (df['Y']>1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In the above Example we are using "&" and "|" operator to pas two conditions at a time in the DataFrame as normal python "and", "or" wont work in this case as it becomes ambiguous as and pythonm can't handle multiple True and False values

# Indexes and its Details

<b> Resetting Indexes </b>

In [212]:
df # printing original df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [213]:
df.reset_index() #This will reset the indexes

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [214]:
df # But the original dataframe will remain the same

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [215]:
df.reset_index(inplace=True) #You have to manually say inplace=True (Permanant)

In [216]:
df #printing the originally changed dataframe, old index became a column now!

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [217]:
df.drop("index", axis=1, inplace=True) #dropping that extra old column!

In [218]:
df

          W         X         Y         Z
0  2.706850  0.628133  0.907969  0.503826
1  0.651118 -0.319318 -0.848077  0.605965
2 -2.018168  0.740122  0.528813 -0.589001
3  0.188695 -0.758872 -0.933237  0.955057
4  0.190794  1.978757  2.605967  0.683509

<b> Setting the Index </b>

In [219]:
newindex = "A B C D E".split()

In [220]:
newindex

['A', 'B', 'C', 'D', 'E']

In [221]:
df

          W         X         Y         Z
0  2.706850  0.628133  0.907969  0.503826
1  0.651118 -0.319318 -0.848077  0.605965
2 -2.018168  0.740122  0.528813 -0.589001
3  0.188695 -0.758872 -0.933237  0.955057
4  0.190794  1.978757  2.605967  0.683509

In [224]:
df['Index'] = newindex

In [225]:
df

          W         X         Y         Z Index
0  2.706850  0.628133  0.907969  0.503826     A
1  0.651118 -0.319318 -0.848077  0.605965     B
2 -2.018168  0.740122  0.528813 -0.589001     C
3  0.188695 -0.758872 -0.933237  0.955057     D
4  0.190794  1.978757  2.605967  0.683509     E

In [227]:
df.set_index('Index', inplace=True)

In [232]:
df

              W         X         Y         Z
Index
A      2.706850  0.628133  0.907969  0.503826
B      0.651118 -0.319318 -0.848077  0.605965
C     -2.018168  0.740122  0.528813 -0.589001
D      0.188695 -0.758872 -0.933237  0.955057
E      0.190794  1.978757  2.605967  0.683509

# Pandas - DataFrames Part 3
***

# Multi-Index and Index Hierarchy

<b> Multi-Index DataFrames<b>

In [23]:
import numpy as np
import pandas as pd

In [24]:
# Index Levels
outside =['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside =[1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [25]:
outside # Printing the outside list

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [26]:
inside # Printing the inside list

[1, 2, 3, 1, 2, 3]

In [27]:
list(zip(outside,inside)) # Zipping both the Lists and making a Hierarchy!

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [28]:
hier_index # Printing the Multi-Index Hierarchy list!

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [29]:
df = pd.DataFrame(randn(6,2), hier_index, ['A', 'B']) # creating a DataFrame

In [30]:
df #printing that df

             A         B
G1 1 -0.096928  0.049892
   2  2.143332 -0.562646
   3 -1.919308  0.048811
G2 1 -1.330167 -0.276744
   2 -0.185045  0.164184
   3 -1.301818 -0.072708

In [31]:
df.loc['G1'].loc[1] # Grabbing the G1 -> 1 Values

A   -0.096928
B    0.049892
Name: 1, dtype: float64

In [32]:
df.loc['G1'] # Grabbing G1 values

          A         B
1 -0.096928  0.049892
2  2.143332 -0.562646
3 -1.919308  0.048811

Right now we can see that there are no names for the indexes in our data frame, we can check it by using .index.names

In [33]:
df.index.names # checking the names

FrozenList([None, None])

In [34]:
df.index.names = ['Groups', 'Numbers'] # Setting names to the indexes

In [35]:
df #printing the df

                       A         B
Groups Numbers
G1     1       -0.096928  0.049892
       2        2.143332 -0.562646
       3       -1.919308  0.048811
G2     1       -1.330167 -0.276744
       2       -0.185045  0.164184
       3       -1.301818 -0.072708

Now Lets say I wanna grab G2->1->B value, I can say:

In [36]:
df.loc['G2'].loc[2]['B'] # This way I can grab that value easily!

0.16418368205287445

In [37]:
df.loc['G1'].loc[3]['A'] # Some more example of grabbing values from the df!

-1.9193080772865667

<b> Grabbing the cross-sections of the DataFrame, this can be used when you have a multi-leve index!</b>

In [38]:
df # Printing the df

                       A         B
Groups Numbers
G1     1       -0.096928  0.049892
       2        2.143332 -0.562646
       3       -1.919308  0.048811
G2     1       -1.330167 -0.276744
       2       -0.185045  0.164184
       3       -1.301818 -0.072708

In [39]:
df.loc['G1'] # Grabbing noremally using .loc[]

                A         B
Numbers
1       -0.096928  0.049892
2        2.143332 -0.562646
3       -1.919308  0.048811

In [40]:
df.xs('G1') # grabbing using .xs() for cross-section

                A         B
Numbers
1       -0.096928  0.049892
2        2.143332 -0.562646
3       -1.919308  0.048811

In [41]:
df.xs(1, level='Numbers') # Grabbing G1, and G2 -> 1 Values

               A         B
Groups
G1     -0.096928  0.049892
G2     -1.330167 -0.276744

In the above example, we have used .xs() function and passed 1 as the inside index of G1 and G2, and we specified the level as the 'Index Name', which wil grab the values of 1 from both G1 and G2..

In [44]:
df.xs(3,level="Numbers") # Some more Examples!

               A         B
Groups
G1     -1.919308  0.048811
G2     -1.301818 -0.072708

<b> Note: </b><br>
This is a very Advanced concept in Pandas that, we wont be using much in this course but, just for your knowledge we have told this also, later this will be used only 1 time when we will be doing Data Capstone Project, that time we will revise this again before we do that!<br><br>
So No need to worry if you are not able to understand this or getting confused in this!
***